Tekla Open API Reference for Tekla Structures 2025
SettingsProxy.TryGetValue Method
 Tries to get the value of the setting with the given name.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool TryGetValue(
	string name,
	out Object obj
)
Public Function TryGetValue (
	name As String,
	<OutAttribute> ByRef obj As Object
) As Boolean
Parameters
name
Type: System.String
The name of the setting.
obj
Type: System.Object
The value of the given setting.
Return Value
Type: Boolean
True on success, false otherwise.
See Also
Reference
SettingsProxy Class
Tekla.Structures.Datatype Namespace